import pytest
from scrapy.loader import ItemLoader

from SpiderNest.models.novel.quanben import QuanbenBook, QuanbenBookChapter
from ....items.novel.quanben import QuanbenBookChapterItem, QuanbenBookItem


@pytest.mark.parametrize('params', [
{'author_name': ['禹枫'],
 'brief': ['\r\n  \t',
           '穿越后,成为已死的废柴少爷,遇上了神秘老者南叔.为亲情,为红颜,为身边最亲的人,陆少游从废柴一步步踏上强者之路.强者之路,一路荆棘遍布,却也阻挡不住一颗强者之心.醉卧美人膝,醒掌天下权,传言武道巅峰,灵道极致,便能踏碎虚空.灵武双修,不世霸枭,既然来了,就要留下一世传奇. ',
           '\r\n  '],
 'category': ['玄幻'],
 'cover': ['http://img.c0m.io/quanben.io/upload/thumbnail/book_0_999/book_4.jpg'],
 'name': ['异世灵武天下'],
 'status': ['完结']},

{'author_name': ['净无痕'],
 'brief': ['\r\n  \t',
           '九霄大陆,宗门林立,能够全面提升武道素质的是武魂!一代强人林枫,穿越异界,逆天出世,得惊世传承,修武道,踏九霄,破天地,傲苍穹!一壶浊酒、一曲情殇、一世尽张狂!英雄仗剑行天下,豪情踏血染青天!',
           '\r\n  '],
 'category': ['玄幻'],
 'cover': ['http://img.c0m.io/quanben.io/upload/thumbnail/book_0_999/book_2.jpg'],
 'name': ['绝世武神'],
 'status': ['完结']}

])
def test_QuanbenBookItem_processor(params):
    loader = ItemLoader(item=QuanbenBookItem())
    for k, v in params.items():
        loader.add_value(k, v)

    assert QuanbenBook(**loader.load_item())


@pytest.mark.parametrize('params', [
{'book_author_name': ['寂小贼'],
 'book_category': ['玄幻'],
 'book_name': ['傲世丹神'],
 'chapter_name': ['丹魔城'],
 'chapter_num': [3764],
 'content': ['<p>第3773章 '
             '丹魔城</p><p>龙月非常满意的点了点头，她突然有点欣赏沈翔了，有点明白创兽始祖为什么要保护沈翔。</p><p>“老前辈，火魔谷现在是你的了。”沈翔对火魔微笑道。</p><p>“不不不……是你的，我没能力守护火魔谷、”火魔满脸惭愧，他对沈翔也和龙月前往他的洞府，来到洞府门口的时候，还有两个紫魔团的人守着，被沈翔三两下就干掉了。</p><p>进入火魔洞里面，火魔拿出许多好东西来招待沈翔和龙月。</p><p>龙月当年来火魔谷的时候很低调，并没有见过火魔，她只是在这儿逗留了几个月就走了，此“你并没有和地狱碑签订血契呀？”龙月有些惊讶。</p><p>“没有，我可能有朝一日也会离开地狱的。”火魔说道：“我在上面有不少仇家！”</p><p>“那些药材是重生散，我这儿还有不少。”沈翔拿出一大盒给火魔。</p><p>“这是一千万创道圣晶，够不够？不够我还有p><p>火魔和龙月顿时惊讶起来，他们没想到沈翔竟然还会炼丹。</p><p>“你想必是创药神州之中的丹神了……你为何与人结仇？即便结仇，也不该被迫躲入地狱来！”火魔惊讶问道。</p><p>“那火魔前辈，你又为何躲到这儿？你似乎在这儿很久了，你有没有上去过？去。”火魔叹道</p><p>沈翔和龙月相视一眼，火魔竟然也得罪了创元神域的人。</p><p>“我们被金火霸主追杀。”龙月说道：“你听过金火霸主吧？”</p><p>“什么？你们竟然得罪这样的家伙……这确实也只能躲入地狱来了，你们是怎么得罪他的？”火魔被惊得从椅子上不了我，是他孙子先要干掉我的。”</p><p>“这……”火魔无语了，金火霸主什么实力他很清楚，沈翔居然把人家的孙子废掉了。</p><p>“火魔，在这儿有没有一个非常安全的地方！”龙月问道：“我多年不来地狱，之前也并不是太了解地狱的情况，你在地狱这么多年来们现在自称丹魔，大家采到药材的时候，都会拿到丹魔城出售给他们。”火魔说道。</p><p>“好，我们就去丹魔城。”龙月说道：“现在就走！”</p><p>沈翔和火魔告别，就被龙月拉着冲出了火魔谷，前往丹魔城。</p><p>龙月从火魔那得到了地图，按照地图上带着沈里面的邪魔恶徒也不是很厉害嘛！”沈翔说道，之前来的时候，龙月可是说得多么厉害，还百般叮嘱沈翔。</p><p>“哼，你会炼丹也不告诉我！你炼丹达到什么水平了？”龙月之前也用过重生散，自然清楚重生散的功效，只是那时她还不知道是沈翔炼制的。</p><p>。</p><p>“你真的有把握修炼出傲世神源？”龙月因为之前被风魔团和紫魔团的人气过，所以她不想在这个鬼地方多留，想快点离开。</p><p>而如今的希望就在沈翔身上，若是沈翔修炼出傲世神源，就有足够的力量对抗金火霸主。</p><p>“当然有，只是现在我还没有药材什么的，那我们先去丹魔城看看吧，或许能找到不错的药材，若是没有，也只能想其他办法了。”沈翔说道。</p><p>龙月此时对沈翔有了信心，毕竟沈翔是个丹神呀！</p><p>“沈翔，你是不是要用九把钥匙把创兽始祖放出来。”龙月说道。</p><p>“嗯，他答就是杀伐邪龙？”沈翔问道。</p><p>“是！我还比较年轻，否则金火霸主根本不是我的对手。”龙月发现沈翔看她的时候，眼神中带着一丝嘲讽，顿时大声说道。</p><p>“你只有一条杀伐邪龙，实力自然弱！”沈翔笑道：“而我有三条！”</p><p>“你那传说咒文吗？”龙p><p>“是的，你要学吗？”沈翔嘻笑道。</p><p>“就算你送我，我也不知道要什么时候才能学会！我本身就掌握一种传说咒文，我若是学习第二种，还不知道要多长时间！”龙月哼了一声。</p><p>“我能让你快速学会，大概一个月左右吧……你真要学，我们可以做个交，我自己就掌握三个传说咒文……我能破碎空间逃脱，就是其中一种。”沈翔笑道：“若不是你身上有我需要的东西，我才懒得和你说这件事。”</p>']},

{'book_author_name': ['寂小贼'],
 'book_category': ['玄幻'],
 'book_name': ['傲世丹神'],
 'chapter_name': ['邪恶一面'],
 'chapter_num': [3763],
 'content': ['[温馨提示]请到 quanben.io 阅读完整章节内容。']}

])
def test_QuenbenBookChapterItem_processor(params):
    loader = ItemLoader(item=QuanbenBookChapterItem())
    for k, v in params.items():
        loader.add_value(k, v)
    assert QuanbenBookChapter(**loader.load_item())